Jmeter/report-20260910-030220/statistics.json
{
  "" : {
    "transaction" : "",
    "sampleCount" : 1000,
    "errorCount" : 1000,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 8.41248075645027,
    "receivedKBytesPerSec" : 7.032308132345148,
    "sentKBytesPerSec" : 0.0
  },
  "Loadtest is not ready" : {
    "transaction" : "Loadtest is not ready",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.13199999999999998,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 8.425309630128908,
    "receivedKBytesPerSec" : 5.4785987261985,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2000,
    "errorCount" : 1000,
    "errorPct" : 50.0,
    "meanResTime" : 0.06600000000000013,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 16.824678438333347,
    "receivedKBytesPerSec" : 12.502354469160364,
    "sentKBytesPerSec" : 0.0
  }
}